In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [4]:
dFrame = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta', 'alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})

In [5]:
dFrame

  k1     k2  dataset1  dataset2
0  X  alpha -0.464619  0.810529
1  X   beta  0.209077 -0.636504
2  Y  alpha  0.927740  0.655093
3  Y   beta  0.353114 -0.810163
4  Z  alpha  0.653977  0.002465

In [6]:
#creating groupby series object
#lets take dataset 1 by k1
group1 = dFrame['dataset1'].groupby(dFrame['k1'])

In [7]:
group1

In [8]:
#perform operation to see it
group1.mean()

k1
X   -0.127771
Y    0.640427
Z    0.653977
Name: dataset1, dtype: float64

In [9]:
#expand example with arrays
cities = np.array(['NY','LA','LA','NY','NY'])

months = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [11]:
#group cities by month
dFrame['dataset1'].groupby([cities,months]).mean()

LA  FEB    0.209077
    JAN    0.927740
NY  FEB    0.353114
    JAN    0.094679
Name: dataset1, dtype: float64

In [12]:
dFrame
#we can see which values line up

  k1     k2  dataset1  dataset2
0  X  alpha -0.464619  0.810529
1  X   beta  0.209077 -0.636504
2  Y  alpha  0.927740  0.655093
3  Y   beta  0.353114 -0.810163
4  Z  alpha  0.653977  0.002465

In [13]:
#pass columns as keys
dFrame.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.127771  0.087013
Y   0.640427 -0.077535
Z   0.653977  0.002465

In [14]:
dFrame.groupby(['k1','k2']).mean()
#mean on multiple columns by passing a list

          dataset1  dataset2
k1 k2
X  alpha -0.464619  0.810529
   beta   0.209077 -0.636504
Y  alpha  0.927740  0.655093
   beta   0.353114 -0.810163
Z  alpha  0.653977  0.002465

In [15]:
dFrame.groupby(['k1']).size()
#how many values I have in dataframe

k1
X    2
Y    2
Z    1
dtype: int64

In [28]:
#iterate over groups
for name,group in dFrame.groupby('k1'):

    print ("This is %s group" %name)

    print (group)

    print ('\n')

This is X group
  k1     k2  dataset1  dataset2
0  X  alpha -0.464619  0.810529
1  X   beta  0.209077 -0.636504


This is Y group
  k1     k2  dataset1  dataset2
2  Y  alpha  0.927740  0.655093
3  Y   beta  0.353114 -0.810163


This is Z group
  k1     k2  dataset1  dataset2
4  Z  alpha  0.653977  0.002465

In [30]:
for (k1,k2), group in dFrame.groupby(['k1','k2']):

    print ("Key1 = %s Key2 = %s" %(k1,k2))

    print (group)

    print ('\n')

Key1 = X Key2 = alpha
  k1     k2  dataset1  dataset2
0  X  alpha -0.464619  0.810529


Key1 = X Key2 = beta
  k1    k2  dataset1  dataset2
1  X  beta  0.209077 -0.636504


Key1 = Y Key2 = alpha
  k1     k2  dataset1  dataset2
2  Y  alpha   0.92774  0.655093


Key1 = Y Key2 = beta
  k1    k2  dataset1  dataset2
3  Y  beta  0.353114 -0.810163


Key1 = Z Key2 = alpha
  k1     k2  dataset1  dataset2
4  Z  alpha  0.653977  0.002465

In [31]:
#creating dictionary 
group_dict = dict(list(dFrame.groupby('k1')))

In [32]:
dFrame

  k1     k2  dataset1  dataset2
0  X  alpha -0.464619  0.810529
1  X   beta  0.209077 -0.636504
2  Y  alpha  0.927740  0.655093
3  Y   beta  0.353114 -0.810163
4  Z  alpha  0.653977  0.002465

In [33]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha -0.464619  0.810529
1  X   beta  0.209077 -0.636504

In [34]:
#d-types of objets (letter d)
group_dict_axis1 = dict(list(dFrame.groupby(dFrame.dtypes,axis=1)))

In [35]:
group_dict_axis1
#we have separation of types - floats and letters by axis = 1

{dtype('float64'):    dataset1  dataset2
 0 -0.464619  0.810529
 1  0.209077 -0.636504
 2  0.927740  0.655093
 3  0.353114 -0.810163
 4  0.653977  0.002465,
 dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [37]:
#groupby with columns
dataset2_group = dFrame.groupby(['k1','k2'])[['dataset2']]

dataset2_group.mean()

          dataset2
k1 k2
X  alpha  0.810529
   beta  -0.636504
Y  alpha  0.655093
   beta  -0.810163
Z  alpha  0.002465